Hi,
I looked into your issue and tried to replicate it but it worked as intended for me, you can see my test further down.

In your initial config you don't have any `policy_assignment` that matches your parameters key `Deploy-Nsg-FlowLogs-to-LA`.
Is the value hardcoded in the `policy_assignment_**.tmpl.json` file and maybe the parameters from the `archetype_extension_**.tmpl.json` is ignored?

One test to verify is to set `null` value for the parameter in the `policy_assignment_**.tmpl.json` file to verify that the parameter is used. like this:
```
    "parameters": {
      "workspace": {
        "value": null
      }
    },
```

## Error replication
I started with the following configuration

`archetype_extension_es_root.tmpl.json`:
```
{
    "extend_es_root": {
        "policy_assignments": [
            "Deploy-NSG-Flowlog-to-LA"
        ],
        "policy_definitions": [],
        "policy_set_definitions": [],
        "role_definitions": [],
        "archetype_config": {
            "parameters": {
                "Deploy-NSG-Flowlog-to-LA": {
                    "workspace" : "/subscriptions/<guid>/resourcegroups/issue104/providers/microsoft.operationalinsights/workspaces/la-issue104"
                }
            },
            "access_control": {}
        }
    }
}
```
Then I tried to changed to use the template_file_variables. 
This did not trigger any changes.

Files:
`archetype_extension_es_root.tmpl.json`:
```
{
    "extend_es_root": {
        "policy_assignments": [
            "Deploy-NSG-Flowlog-to-LA"
        ],
        "policy_definitions": [],
        "policy_set_definitions": [],
        "role_definitions": [],
        "archetype_config": {
            "parameters": {
                "Deploy-NSG-Flowlog-to-LA": {
                    "workspace" : "${log_analytics_workspace_id}"
                }
            },
            "access_control": {}
        }
    }
}
```
`es_issue104.tf`:
```
module "enterprise_scale" {
  source  = "Azure/caf-enterprise-scale/azurerm"
  version = "0.3.1"

  root_parent_id   = data.azurerm_client_config.current.tenant_id
  default_location = "westeurope"
  root_id          = "es-i104"
  root_name        = "es-i104"
  library_path     = "${path.root}/lib"

  template_file_variables = {
    log_analytics_workspace_id = "/subscriptions/<guid>/resourcegroups/issue104/providers/microsoft.operationalinsights/workspaces/la-issue104"
  }
}
```

Finally I changed log_analytics_workspace_id in `template_file_variables` to a mockup value of `xpto` just as you tried.
This triggered a change as it is supposed to:

``` 
Terraform will perform the following actions:

  # module.enterprise_scale.azurerm_policy_assignment.enterprise_scale["/providers/Microsoft.Management/managementGroups/es-i104/providers/Microsoft.Authorization/policyAssignments/Deploy-NSG-Flowlog-to-LA"] must be replaced
-/+ resource "azurerm_policy_assignment" "enterprise_scale" {
      ~ id                   = "/providers/Microsoft.Management/managementGroups/es-i104/providers/Microsoft.Authorization/policyAssignments/Deploy-NSG-Flowlog-to-LA" -> (known after apply)
      ~ metadata             = jsonencode(
            {
              - createdBy = "<redacted>"
              - createdOn = "2021-05-17T20:32:47.5535361Z"
              - updatedBy = null
              - updatedOn = null
            }
        ) -> (known after apply)
        name                 = "Deploy-NSG-Flowlog-to-LA"
      ~ parameters           = jsonencode(
          ~ {
              ~ workspace = {
                  ~ value = "/subscriptions/<guid>/resourcegroups/issue104/providers/microsoft.operationalinsights/workspaces/la-issue104" -> "xpto"
                }
            } # forces replacement
        )
        # (6 unchanged attributes hidden)

      ~ identity {
          ~ principal_id = "<redacted>" -> (known after apply)
          ~ tenant_id    = "<redacted>" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }
```